ext_common_addition/ОбщиеДоработкиРВК/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8eac9a31-ed8b-4965-85f9-086b89e1764b">
  <name>РеализацияТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="015a5e71-6dc7-4bc2-a50c-fa1ea71ab233">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="888045d6-ba8c-43b1-b536-7c557764fc60">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b94b39c7-d1eb-4128-89ea-6fe5410160da">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="50c9ead0-2833-4f57-86bb-47fa6ffdc8aa">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="73c9f7da-a335-4b2e-976f-57e95ab06e13">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e5b27a28-42e1-42b3-806c-83e1fbeb7907">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="8139626e-8ad5-43ef-8108-a207607b40b5">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="a37e84ac-bf38-4699-99ca-e57572841cfc">
    <name>ВидыЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e4986aa8-bcf8-443e-9b49-4140b2505fa4">
      <name>АналитикаУчетаНоменклатуры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ext_common_addition/ОбщиеДоработкиРВК/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="492f859c-898a-4672-ab31-9d0ca13acabc">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="507f3953-94e1-46ef-8c8d-0688fd890a1d">
    <name>ПродажаОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5df46640-a48c-42a3-84ec-3c9f97ce2844">
    <name>ПродажаНеОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9f70eac4-2b8c-4400-9fb7-f3d4230ad33e">
    <name>ПродажаНаЭкспорт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1270ac55-6965-4dae-b63b-1266cf1cca2a">
    <name>ПродажаОблагаетсяЕНВД</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ext_common_addition/ОбщиеДоработкиРВК/src/Documents/РеализацияТоваровУслуг/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура рвк_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
		
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		рвк_ЗаполнитьНалогообложениеНаСервере(
			Объект.НалогообложениеНДС,
			Объект.Организация,
			Объект.Контрагент);	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура рвк_ПриОткрытииПосле(Отказ)
	рвк_ОбновитьЗадолженностьНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура рвк_ПартнерПриИзмененииПосле(Элемент)
	рвк_ОбновитьЗадолженностьНаКлиенте();
	
	рвк_ЗаполнитьНалогообложениеНаСервере(
		Объект.НалогообложениеНДС,
		Объект.Организация,
		Объект.Контрагент);	

КонецПроцедуры

&НаКлиенте
Процедура рвк_КонтрагентПриИзмененииПосле(Элемент)
	
	рвк_ЗаполнитьНалогообложениеНаСервере(
		Объект.НалогообложениеНДС,
		Объект.Организация,
		Объект.Контрагент);	

КонецПроцедуры

&НаКлиенте
Процедура рвк_ОрганизацияПриИзмененииПосле(Элемент)

	рвк_ЗаполнитьНалогообложениеНаСервере(
		Объект.НалогообложениеНДС,
		Объект.Организация,
		Объект.Контрагент);	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура рвк_ТоварыНоменклатураАвтоПодборВместо(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ДанныеВыбора 		 = Неопределено;	
	
	НовыйМассив 		 = рвк_НоменклатураВызовСервера.МассивПолученияДанныхВыбор(); 
	ФиксированныйМассив  = Новый ФиксированныйМассив(НовыйМассив);
	
	Отбор 				 = Новый Структура;
	Отбор.Вставить("ТипНоменклатуры",ФиксированныйМассив);
	
	ПараметрыДляПолученияДанныхВыбора = Новый Структура;
	ПараметрыДляПолученияДанныхВыбора.Вставить("НалогообложениеНДС", рвк_НоменклатураВызовСервера.НалогообложениеНДСПолученияДанныхВыбор());
	ПараметрыДляПолученияДанныхВыбора.Вставить("Отбор",Отбор);
	ПараметрыДляПолученияДанныхВыбора.Вставить("СтрокаПоиска",Текст);
	ПараметрыДляПолученияДанныхВыбора.Вставить("ВыборГруппИЭлементов",ИспользованиеГруппИЭлементов.Элементы);
	ПараметрыДляПолученияДанныхВыбора.Вставить("СпособПоискаСтроки",Неопределено);
	ПараметрыДляПолученияДанныхВыбора.Вставить("ПолнотекстовыйПоиск",Неопределено);
	
	рвк_НоменклатураВызовСервера.НоменклатураОбработкаПолученияДанныхВыбораВДокументПродажи(ДанныеВыбора, ПараметрыДляПолученияДанныхВыбора, СтандартнаяОбработка);
	
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура рвк_ЗаполнитьНалогообложениеНаСервере(НалогообложениеНДС, Знач Организация, Знач Контрагент)
	ОрганизацияИНН = рвк_ЗначениеРеквизитаОбъектаНаСервере(Организация, "ИНН");
	КонтрагентНаименование = рвк_ЗначениеРеквизитаОбъектаНаСервере(Контрагент, "Наименование");
	КонтрагентЧастноеЛицо = СтрНачинаетсяС(КонтрагентНаименование, "Частное лицо"); 		
	Если ОрганизацияИНН = "772161119773" И КонтрагентЧастноеЛицо Тогда
		НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД");
	ИначеЕсли ОрганизацияИНН = "772161119773" И НЕ КонтрагентЧастноеЛицо Тогда
		НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС");
	Иначе
		НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция рвк_ЗначениеРеквизитаОбъектаНаСервере(Объект, ИмяРеквизита)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, ИмяРеквизита);
КонецФункции

&НаСервереБезКонтекста
Функция рвк_ПолучитьПросрочкуНаСервере(Клиент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(РасчетыПоСрокам.ПредоплатаРеглОстаток) КАК НашДолг,
		|	СУММА(РасчетыПоСрокам.ДолгРеглОстаток) КАК Задолженность,
		|	СУММА(ВЫБОР
		|			КОГДА РасчетыПоСрокам.ДатаПлановогоПогашения < НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|				ТОГДА РасчетыПоСрокам.ДолгРеглОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Просрочено
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(, АналитикаУчетаПоПартнерам.Партнер = &Партнер) КАК РасчетыПоСрокам";
	
	Запрос.УстановитьПараметр("Партнер", Клиент);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтруктураРезультата = Новый Структура("Задолженность,Просрочено", 0, 0);
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Задолженность) Тогда
			СтруктураРезультата.Задолженность = ВыборкаДетальныеЗаписи.Задолженность;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Просрочено) Тогда
			СтруктураРезультата.Просрочено = ВыборкаДетальныеЗаписи.Просрочено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции

&НаКлиенте
Процедура рвк_ОбновитьЗадолженностьНаКлиенте()
	
	Если Не ЗначениеЗаполнено(Объект.Партнер) Тогда
		Элементы.ЗадолженностьСтрокой.Заголовок = "";
		Возврат;
	КонецЕсли;
		
	Результат = рвк_ПолучитьПросрочкуНаСервере(Объект.Партнер);
	Если Результат.Задолженность = 0 Тогда
		Элементы.ЗадолженностьСтрокой.Заголовок = "";
	ИначеЕсли Результат.Задолженность = Результат.Просрочено Тогда
		Элементы.ЗадолженностьСтрокой.Заголовок = СтрШаблон("Просрочено: %1", Формат(Результат.Просрочено, "ЧДЦ=0; ЧН="));
	Иначе
		Элементы.ЗадолженностьСтрокой.Заголовок = СтрШаблон("Задолженность: %1 Просрочено: %2", Формат(Результат.Задолженность, "ЧДЦ=0; ЧН="), Формат(Результат.Просрочено, "ЧДЦ=0; ЧН="));
	КонецЕсли;
	
	Если Результат.Просрочено > 0 Тогда
		Элементы.ЗадолженностьСтрокой.ЦветТекста = WebЦвета.КрасноФиолетовый;
	Иначе
		Элементы.ЗадолженностьСтрокой.ЦветТекста = WebЦвета.Черный;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
